docs/posts/2008-10-24-academic-reference-software.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 28, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Academic Reference Software</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Academic Reference Software</h1>
<p class="subtitle" role="doc-subtitle">Oct 24, 2008</p>
</header><p>
If you have writing projects that require footnotes, endnotes, bibliographies, or other kinds of references, you should consider getting some kind of reference manager software. Short papers with a few references are easy enough to manage with a word processor alone, but significant projects can easily be overwhelming. There is enough pain in academic writing that one does not need the extra suffering caused by having to make sure that every work cited is included in the bibliography, that the entries are all in alphabetical order, and that the notes and bibliography entries are all in the right format. A reference manager can do all of this automatically. Unfortunately, they&rsquo;re generally very expensive.
</p>

<p>
The good news is that <a href="http://www.thirdstreetsoftware.com/site/introduction.html%22%20title=%22The%20Academic%20Reference%20Manager%20for%20Mac%20OS%20X">Third Street Software</a> just released an undergraduate edition of its reference manager software, Sente. The individual library size is limited to 250 entries, but that should be sufficient for most student writing. It&rsquo;s also Mac OS X only, but now you have one more way to convince you parents that you really need that new Mac notebook: &ldquo;I know it seems more expensive now, but I promise that it will save you money in the long run&#x2026;.&rdquo; Good luck, let me know if it works.
</p>


<div class="tagline" id="org7f7d53c">
<p>
Tagged: <a href="../tags/teaching.html">Teaching</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 28, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
